app/views/seminartopics/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <td><%= seminartopic.descripton %></td>
        <td><%= User.find_by_id(seminartopic.user_id).try(:username) %></td>