app/views/seminartopics/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <strong>User:</strong>
  <%= User.find_by_id(@seminartopic.user_id).try(:username) %>