app/controllers/seminartopics_controller.rb

  def index
    @seminartopics = Seminartopic.all
---
SELECT "seminartopics".* FROM "seminartopics"

  def create
    @seminartopic = Seminartopic.new(seminartopic_params)
    respond_to do |format|
      if @seminartopic.save
---
INSERT INTO "seminartopics" ("title", "descripton", "studname", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @seminartopic.update(seminartopic_params)
---
UPDATE "seminartopics" SET "descripton" = ?, "studname" = ?, "updated_at" = ? WHERE "seminartopics"."id" = ?  [["descripton", "descripton"], ["studname", "dharani"], ["updated_at", "2019-03-18 10:41:49.889656"], ["id", 1]]

  def destroy
    @seminartopic.destroy
---
DELETE FROM "seminartopics" WHERE "seminartopics"."id" = ?  [["id", 5]]

  def set_seminartopic
    @seminartopic = Seminartopic.find(params[:id])
---
SELECT  "seminartopics".* FROM "seminartopics" WHERE "seminartopics"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]