app/models/user.rb

  def self.find_for_database_authentication(warden_conditions)
---
SELECT  "users".* FROM "users" WHERE (lower(username) = 'dharani' OR lower(email) = 'dharani') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]